Documents/РасчетФакторовРиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РасчетФакторовРиска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервыйТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВторойТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТретийТриместр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФакторыРиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФакторРиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФакторыРиска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервыйТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВторойТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТретийТриместр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФакторыРиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФакторыРиска</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Баллы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможенВыборНесколькихДочернихЭлементов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РасчетФакторовРиска/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьНаОбновлениеТаблицуИОбновитьДеревоЗначения();
	Если Параметры.Свойство("Клиент") Тогда
		Объект.Клиент = Параметры.Клиент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Клиент) Тогда
		КлиентПриИзменении(Неопределено);
	КонецЕсли;
	
	Элементы.ДеревоФакторовРиска.НачальноеОтображениеДерева=НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФакторыРискаПередНачаломИзменения(Элемент, Отказ)
	
	СТД = Элементы.ДеревоФакторовРиска.ТекущиеДанные;
	Если СТД <> Неопределено Тогда 
		Если СТД.Баллы = 0 Тогда
			Отказ = Истина;
			Возврат;
		Иначе
			
			Отказ = ПроверитьВозможностиМножественногоВыбораДочернихЭлементов(СТД.ФакторРиска, Элемент.ТекущийЭлемент.Имя);
			Если Отказ Тогда
				Предупреждение("В данной группе невозможен выбор нескольких элементов.",30);
			Иначе
				МассивРезультат = Объект.ФакторыРиска.НайтиСтроки(Новый Структура("ФакторРиска", СТД.ФакторРиска)); 
				Если  Элемент.ТекущийЭлемент.Имя = "ДеревоФакторовРискаПервыйТриместр" Тогда		
					МассивРезультат[0].ПервыйТриместр = Не МассивРезультат[0].ПервыйТриместр;
				ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДеревоФакторовРискаВторойТриместр" Тогда		
					МассивРезультат[0].ВторойТриместр = Не МассивРезультат[0].ВторойТриместр;
				ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ДеревоФакторовРискаТретийТриместр" Тогда
					МассивРезультат[0].ТретийТриместр = Не МассивРезультат[0].ТретийТриместр;	
				КонецЕсли;
			КонецЕсли;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностиМножественногоВыбораДочернихЭлементов(ФакторРиска, РедактируемаяКолонка)
	
	Если ЗначениеЗаполнено(ФакторРиска.Родитель) И Не ФакторРиска.Родитель.ВозможенВыборНесколькихДочернихЭлементов Тогда
		Выборка = Справочники.ФакторыРиска.Выбрать(ФакторРиска.Родитель);
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка <> ФакторРиска Тогда
				
				МассивРезультат = Объект.ФакторыРиска.НайтиСтроки(Новый Структура("ФакторРиска", Выборка.Ссылка));
				Если ЗначениеЗаполнено(МассивРезультат) 
					И  (РедактируемаяКолонка = "ДеревоФакторовРискаПервыйТриместр" И МассивРезультат[0].ПервыйТриместр 
					Или РедактируемаяКолонка = "ДеревоФакторовРискаВторойТриместр" И МассивРезультат[0].ВторойТриместр
					Или РедактируемаяКолонка = "ДеревоФакторовРискаТретийТриместр" И МассивРезультат[0].ТретийТриместр) 
				Тогда 
					Возврат Истина;					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	СсылкаНаОткрываемыйОбъект = ПолучитьАктуальнуюСсылку();
	Если СсылкаНаОткрываемыйОбъект <> Неопределено Тогда
		
		Ответ = Вопрос("Открыть актуальный документ """ + СсылкаНаОткрываемыйОбъект + """ для клиента " + Объект.Клиент + "?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			ПоказатьЗначение(,СсылкаНаОткрываемыйОбъект);
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальнуюСсылку(Дата = Неопределено)
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетФакторовРиска.Ссылка,
		|	РасчетФакторовРиска.Дата КАК Дата,
		|	РасчетФакторовРиска.ДатаПервыйТриместр,
		|	РасчетФакторовРиска.ДатаВторойТриместр,
		|	РасчетФакторовРиска.ДатаТретийТриместр,
		|	РасчетФакторовРиска.ФакторыРиска.(
		|		Ссылка,
		|		НомерСтроки,
		|		ФакторРиска,
		|		Баллы,
		|		ПервыйТриместр,
		|		ВторойТриместр,
		|		ТретийТриместр
		|	)
		|ИЗ
		|	Документ.РасчетФакторовРиска КАК РасчетФакторовРиска
		|ГДЕ
		|	РасчетФакторовРиска.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если НачалоДня(ВыборкаДетальныеЗаписи.Дата) > НачалоДня(Дата) Тогда
			
			Результат = ВыборкаДетальныеЗаписи.Ссылка;
		    
		Иначе
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаПервыйТриместр) 
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаВторойТриместр)
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаТретийТриместр) 
			Тогда
			
			    Объект.ФакторыРиска.Очистить();
			    Объект.ФакторыРиска.Загрузить(ВыборкаДетальныеЗаписи.ФакторыРиска.Выгрузить());
				ПроверитьНаОбновлениеТаблицуИОбновитьДеревоЗначения();

			Иначе
				
				Результат = ВыборкаДетальныеЗаписи.Ссылка;
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПроверитьНаОбновлениеТаблицуИОбновитьДеревоЗначения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФакторыРиска.Ссылка КАК ФакторРиска,
	|	ФакторыРиска.Баллы КАК Баллы,
	|	ФакторыРиска.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ФакторыРиска КАК ФакторыРиска
	|ГДЕ
	|	НЕ ФакторыРиска.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФакторРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Если ВыборкаДетальныеЗаписи.Количество() <> Объект.ФакторыРиска.Количество() Тогда	
		
		Если Объект.ФакторыРиска.Количество() <> 0 Тогда
			
			Таблица = РезультатЗапроса.Выгрузить();
			Таблица.Колонки.Добавить("ПервыйТриместр");
			Таблица.Колонки.Добавить("ВторойТриместр");
			Таблица.Колонки.Добавить("ТретийТриместр");
			Таблица.Колонки.Добавить("Уровень");
			
			Для каждого Стр Из Таблица Цикл
				
				СтрокаРезультат = Объект.ФакторыРиска.НайтиСтроки(Новый Структура("ФакторРиска", Стр.ФакторРиска.Ссылка));
				Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
					Стр.ПервыйТриместр 	= СтрокаРезультат[0].ПервыйТриместр;
					Стр.ВторойТриместр 	= СтрокаРезультат[0].ВторойТриместр;
					Стр.ТретийТриместр 	= СтрокаРезультат[0].ТретийТриместр;
					Стр.Уровень 		= СтрокаРезультат[0].Уровень;
				КонецЕсли;
				
			КонецЦикла;
			
			Объект.ФакторыРиска.Загрузить(Таблица);
			
		Иначе
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Строка 				= Объект.ФакторыРиска.Добавить();
				Строка.ФакторРиска 	= ВыборкаДетальныеЗаписи.ФакторРиска;
				Строка.Баллы		= ВыборкаДетальныеЗаписи.Баллы;
				Строка.Уровень 		= ВыборкаДетальныеЗаписи.ФакторРиска.Уровень();
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не Объект.Ссылка.Пустая() Тогда
			Записать();
		КонецЕсли;
		
	КонецЕсли;

	Дерево = РеквизитФормыВЗначение("ДеревоФакторовРиска");
	Дерево.Строки.Очистить();
	Для Каждого Стр Из Объект.ФакторыРиска Цикл
		
		Если ЗначениеЗаполнено(Стр.ФакторРиска.Родитель) Тогда
			Массив = Дерево.Строки.НайтиСтроки(Новый Структура("ФакторРиска",Стр.ФакторРиска.Родитель));
			Если ЗначениеЗаполнено(Массив) Тогда
				Строка = Массив[0].Строки.Добавить();
			ИначеЕсли Стр.Баллы <> 0 Тогда
				МассивДочерний = Дерево.Строки.НайтиСтроки(Новый Структура("ФакторРиска",Стр.ФакторРиска.Родитель.Родитель));
				Массив = МассивДочерний[0].Строки.НайтиСтроки(Новый Структура("ФакторРиска",Стр.ФакторРиска.Родитель));
				Строка = Массив[0].Строки.Добавить();
			Иначе
				Строка 	= Дерево.Строки.Добавить();
			КонецЕсли;
		Иначе
			Строка = Дерево.Строки.Добавить();
		КонецЕсли;
		
		Строка.ФакторРиска		= Стр.ФакторРиска;
		Строка.Баллы			= Стр.Баллы;
		Строка.ПервыйТриместр 	= Стр.ПервыйТриместр;
		Строка.ВторойТриместр 	= Стр.ВторойТриместр;
		Строка.ТретийТриместр 	= Стр.ТретийТриместр;
		Строка.Уровень			= Стр.Уровень;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоФакторовРиска"); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры
